
Процедура kol_tst_1_Основное_Тестовый_Канал1СНазначениеОбработкаПолученияСообщения(Сообщение, Отказ)
	
	ТекстСообщения = СтрШаблон("Начало получения сообщения %1 от %2", Сообщение.Идентификатор, Сообщение.КодОтправителя);
	ЗаписьЖурналаРегистрации("Сервисы интеграции.Обработка", УровеньЖурналаРегистрации.Информация, , ТекстСообщения); 
	
	Попытка
		
		РазмерСообщения = Сообщение.Параметры.Получить("РазмерСообщения");
		Если РазмерСообщения = Неопределено Тогда 
			РазмерБуфера = 1024;
		Иначе
			РазмерБуфера = Число(РазмерСообщения);
		КонецЕсли;
		
		Тело = Новый БуферДвоичныхДанных(0);
		Буфер = Новый БуферДвоичныхДанных(РазмерБуфера);
		Поток = Сообщение.ПолучитьТелоКакПоток();
		
		Пока Истина Цикл
			
			Прочитано = Поток.Прочитать(Буфер, 0, РазмерБуфера);
			
			Если Прочитано > 0 Тогда
				Тело = Тело.Соединить(Буфер);	
			КонецЕсли;
			
			Если Прочитано < РазмерБуфера Тогда
				Прервать;
			КонецЕсли; 
			
		КонецЦикла;
		
		ВходящееСообщение = ПолучитьСтрокуИзБуфераДвоичныхДанных(Тело);
		
		Если ВходящееСообщение <> "" Тогда
			
			ЧтениеJSON = Новый ЧтениеJSON();
			ЧтениеJSON.УстановитьСтроку(ВходящееСообщение);
            СтруктураНоменклатуры = ПрочитатьJSON(ЧтениеJSON);
			ОбновитьНоменклатуру(СтруктураНоменклатуры);
			
		КонецЕсли;  
		
		ТекстСообщения = СтрШаблон("Сообщение %1 от %2 успешно обработано.", Сообщение.Идентификатор, Сообщение.КодОтправителя);
		ЗаписьЖурналаРегистрации("Сервисы интеграции.Обработка", УровеньЖурналаРегистрации.Информация, , ТекстСообщения); 
		
	Исключение  
		
	    Отказ = Истина;
		ТекстСообщения = СтрШаблон("%1. Не удалось обработать сообщение ID: %2 от %3", ОписаниеОшибки(), Сообщение.Идентификатор, Сообщение.КодОтправителя);
		
		ЗаписьЖурналаРегистрации("Сервисы интеграции.Обработка", УровеньЖурналаРегистрации.Ошибка, , ТекстСообщения); 
	КонецПопытки; 
	
КонецПроцедуры


Процедура ОбновитьНоменклатуру(СтруктураНоменклатуры)
	
	Запрос = Новый Запрос("ВЫБРАТЬ Ссылка ИЗ Справочник.Номенклатура ГДЕ Артикул = &Артикул И Наименование = &Наименование");
	Запрос.УстановитьПараметр("Артикул", СтруктураНоменклатуры.Артикул);
	Запрос.УстановитьПараметр("Наименование", СтруктураНоменклатуры.Наименование);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		НоменклатураОбъект = Выборка.Ссылка.ПолучитьОбъект();
	Иначе
		НоменклатураОбъект = Справочники.Номенклатура.СоздатьЭлемент();
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(НоменклатураОбъект, СтруктураНоменклатуры);
	
	НоменклатураОбъект.Записать();   
	
КонецПроцедуры
